Autodesk.Revit.DB.FailuresAccessor.JournalFailures(System.Collections.Generic.IList{Autodesk.Revit.DB.FailureMessageAccessor})
Allows to record information about failures in the journal.
Remarks:
Records information about failure messages and elements involved in the failures.
If this method not invoked, journal does not contain any information about failures
resolved by (pre)processing.
failures:
Accessors to the failures to journal.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailuresAccessor is inactive (is used outside of failures processing).
Since:
2011

Autodesk.Revit.DB.FailuresAccessor.RollBackPendingTransaction
Finishes pending failures processing by rolling back the pending transaction.
Returns:
Result of attempt to roll back the pending transaction.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailuresAccessor is inactive (is used outside of failures processing).
-or-
The processing of the failures is not in the pending state.
Since:
2011

Autodesk.Revit.DB.FailuresAccessor.CommitPendingTransaction
Finishes pending failures processing by committing the pending transaction.
Returns:
Result of attempt to commit the pending transaction.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailuresAccessor is inactive (is used outside of failures processing).
-or-
The processing of the failures is not in the pending state.
-or-
There is no pending transaction or transaction is not allowed to be committed.
Since:
2011

Autodesk.Revit.DB.FailuresAccessor.IsPending
Checks if the failure processing is pending.
Remarks:
The failure processing is pending after failures processor has returned WaitForUserInput
and until pending state is finished by either committing or rolling back of the pending transaction.
Returns:
True if the failures processing is in the pending state.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailuresAccessor is inactive (is used outside of failures processing).
Since:
2011

Autodesk.Revit.DB.FailuresAccessor.CanRollBackPendingTransaction
Checks if pending failure processing can be finished by rolling back a pending transaction.
Remarks:
Check makes sense only if the failure processing is pending.
Returns:
True if there is a pending transaction and this transaction is allowed to be rolled back
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailuresAccessor is inactive (is used outside of failures processing).
Since:
2011

Autodesk.Revit.DB.FailuresAccessor.CanCommitPendingTransaction
Checks if pending failure processing can be finished by committing a pending transaction.
Remarks:
Check makes sense only if the failure processing is pending.
Returns:
True if there is a pending transaction and this transaction is allowed to be committed.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailuresAccessor is inactive (is used outside of failures processing).
Since:
2011

Autodesk.Revit.DB.FailuresAccessor.GetAttemptedResolutionTypes(Autodesk.Revit.DB.FailureMessageAccessor)
Returns list of the failure resolution types attempted for the failure in the current transaction.
Remarks:
In some cases attempt to resolve a failure has no impact or failure gets reposted during next round of the end of transaction checks
after being resolved. Knowing if any failure resolutions were attempted for the failure allows failures processor
to prevent infinite loop.
failure:
The failure.
Returns:
The list of the types of failure resolutions attempted for the failure.
Throws Autodesk.Revit.Exceptions.ArgumentException:
failure has not been properly initialized.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailuresAccessor is inactive (is used outside of failures processing).
Since:
2011

Autodesk.Revit.DB.FailuresAccessor.DeleteElements(System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Resolves failures by deletion of elements related to the failures.
idsToDelete:
Ids of elements to be deleted.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Resolution of the failures by deleting idsToDelete is not permitted
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailuresAccessor is inactive (is used outside of failures processing).
Since:
2011

Autodesk.Revit.DB.FailuresAccessor.ResolveFailures(System.Collections.Generic.IList{Autodesk.Revit.DB.FailureMessageAccessor})
Resolves one or more failures using last set failure resolution type for each of the failures.
If failure resolution type was not set for some of failures, default failure resolution type will be used.
Remarks:
After execution of the failure resolutions the failures will not be removed from the document automatically. To
prevent failure from being delivered to the user, failures (pre)processor should return ProceedWithCommit.
It will cause failures to be regenerated and failure resolution process to be restarted.
If attempt to resolve failure was not successful, and the same failure is present on repetitive calls
of the failures (pre)processor, 	the preprocessor code should take care to attempt
a different resolution the next time the failure appears, to avoid an infinite loop.
failures:
The accessors to the failures to be resolved.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Default resolution of one of the failures is not permitted or not applicable.
-or-
One of the failures was already attempted to resolve twice with that resolution type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailuresAccessor is inactive (is used outside of failures processing).
-or-
Resolution of failures is not permitted in the current state of the document.
Since:
2011

Autodesk.Revit.DB.FailuresAccessor.ResolveFailure(Autodesk.Revit.DB.FailureMessageAccessor)
Resolves one failure using the failure resolution type last set for it.
Remarks:
If failure resolution type was not set, the default failure resolution type will be used.
After execution of the failure resolution the failure will not be removed from the document automatically. To
prevent the failure from being delivered to the user, failures (pre)processor should return ProceedWithCommit.
It will cause failures to be regenerated and failure resolution process to be restarted.
If attempt to resolve failure was not successful, and the same failure is present on repetitive calls
of the failures (pre)processor, 	the preprocessor code should take care to attempt
a different resolution the next time the failure appears, to avoid an infinite loop.
failure:
The accessor to the failure to be resolved.
Throws Autodesk.Revit.Exceptions.ArgumentException:
failure has not been properly initialized.
-or-
failure does not have any resolutions.
-or-
Default resolution of failure is not permitted or not applicable.
-or-
The failure was already attempted to resolve twice with that resolution type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailuresAccessor is inactive (is used outside of failures processing).
-or-
Resolution of failures is not permitted in the current state of the document.
Since:
2011

Autodesk.Revit.DB.FailuresAccessor.DeleteAllWarnings
Deletes all FailureMessages of severity "Warning" currently posted in a document.
Remarks:
Warnings are deleted immediately and will not be accessible by any further failures processing.
Any accessors for these failure messages become invalid.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailuresAccessor is inactive (is used outside of failures processing).
Since:
2011

Autodesk.Revit.DB.FailuresAccessor.DeleteWarning(Autodesk.Revit.DB.FailureMessageAccessor)
Deletes one specific failure message of severity "Warning".
failure:
The accessor to the warning to be deleted.
Throws Autodesk.Revit.Exceptions.ArgumentException:
failure has not been properly initialized.
-or-
Severity of failure is not FailureSeverity::Warning.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailuresAccessor is inactive (is used outside of failures processing).
Since:
2011

Autodesk.Revit.DB.FailuresAccessor.PostFailure(Autodesk.Revit.DB.FailureMessage)
Posts an additional failure message to be processed for the current transaction.
Remarks:
Should be used during failures processing instead of a similar method in a document class.
Using method of the document class with the same name during failures processing is prohibited.
failure:
Failure message to post.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailuresAccessor is inactive (is used outside of failures processing).
Since:
2011

Autodesk.Revit.DB.FailuresAccessor.ReplaceFailures(Autodesk.Revit.DB.FailureMessage)
Deletes all failure messages currently posted in a document and replaces them with one "generic" failure.
Remarks:
If analysis done by Failures Processing code concludes that in a given context delivering
of the posted failures to the user makes no sense, this method can be used to discard all posted failures
and substitute one "generic" one, that will be delivered to the user and then transaction
forced to be aborted.
After the call, (pre)processing of failures should return ProceedWithRollback.
failure:
FailureMessage that should replace all currently posted messages. It must have severity DocumentCorruption.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Severity of failure must be FailureSeverity::DocumentCorruption.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailuresAccessor is inactive (is used outside of failures processing).
Since:
2011

Autodesk.Revit.DB.FailuresAccessor.SetFailureHandlingOptions(Autodesk.Revit.DB.FailureHandlingOptions)
Sets failure handling options for the transaction currently being finished.
Remarks:
If used with returning ProceedWithRollback from (pre)processing, allows to dismiss errors and roll back transaction
without any further failures processing and silently for the user.
options:
The failure handling options to be set for the transaction currently being finished.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailuresAccessor is inactive (is used outside of failures processing).
Since:
2011

Autodesk.Revit.DB.FailuresAccessor.GetFailureHandlingOptions
Provides access to the failure handling options for the transaction currently being finished.
Returns:
The failure handling options for transaction currently being finished.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailuresAccessor is inactive (is used outside of failures processing).
Since:
2011

Autodesk.Revit.DB.FailuresAccessor.IsElementsDeletionPermitted(System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId},System.String@)
Checks if resolution of the failures by deleting given collection of elements is permitted.
Remarks:
Method does not confirm if deletion of the elements will or may resolve the failure - it simply verifies
that given elements can be deleted in the current state of the document.
idsToDelete:
The Ids of elements to be deleted.
reason:
A localized string explaining reason why the elements cannot be deleted.
Returns:
True if resolution of the failures by deleting given elements is permitted
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailuresAccessor is inactive (is used outside of failures processing).
Since:
2011

Autodesk.Revit.DB.FailuresAccessor.IsElementsDeletionPermitted(System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Checks if resolution of the failures by deleting given collection of elements is permitted.
Remarks:
Method does not confirm if deletion of the elements will or may resolve the failure - it simply verifies
that given elements exist and can be deleted in the current state of the document.
idsToDelete:
The Ids of elements to be deleted.
Returns:
True if resolution of the failures by deleting given elements is permitted.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailuresAccessor is inactive (is used outside of failures processing).
Since:
2011

Autodesk.Revit.DB.FailuresAccessor.IsElementsDeletionPermitted
Checks if resolution of the failures by deleting failure elements is permitted.
Returns:
True if resolution of the failures by deleting failure elements is permitted.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailuresAccessor is inactive (is used outside of failures processing).
Since:
2011

Autodesk.Revit.DB.FailuresAccessor.IsFailureResolutionPermitted(Autodesk.Revit.DB.FailureMessageAccessor,Autodesk.Revit.DB.FailureResolutionType)
Checks if resolution of the failure using given resolution type is permitted.
failure:
Accessor to the failure to be resolved.
resolutionType:
Type of the failure resolution to be used.
Returns:
True if resolution of the failure using given resolution type is permitted.
Throws Autodesk.Revit.Exceptions.ArgumentException:
failure has not been properly initialized.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailuresAccessor is inactive (is used outside of failures processing).
Since:
2011

Autodesk.Revit.DB.FailuresAccessor.IsFailureResolutionPermitted(Autodesk.Revit.DB.FailureMessageAccessor)
Checks if default resolution of the failure is permitted.
failure:
The accessor to the failure to be resolved.
Returns:
True if default resolution of the failure is permitted
Throws Autodesk.Revit.Exceptions.ArgumentException:
failure has not been properly initialized.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailuresAccessor is inactive (is used outside of failures processing).
Since:
2011

Autodesk.Revit.DB.FailuresAccessor.IsFailureResolutionPermitted
Checks if resolution of failures is permitted.
Returns:
True if resolutions of failures is permitted.
Since:
2011

Autodesk.Revit.DB.FailuresAccessor.IsTransactionBeingCommitted
Checks if the transaction for which failures are processed is being committed or rolled back.
Remarks:
A transaction is considered as "being committed" if a caller has requested the transaction to be committed and
no previous failure processing operation requested the transaction to be rolled back.
Returns:
True if current transaction is being committed, false if the transaction is being rolled back.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailuresAccessor is inactive (is used outside of failures processing).
Since:
2011

Autodesk.Revit.DB.FailuresAccessor.GetFailureMessages(Autodesk.Revit.DB.FailureSeverity)
Provides access to the individual failure messages if a given severity currently posted in the document.
severity:
The failure severity for which failure messages are requested.
If the requested severity is None, an empty collection is returned.
Returns:
Accessors to the individual failure messages of a given severity posted in the document.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailuresAccessor is inactive (is used outside of failures processing).
Since:
2011

Autodesk.Revit.DB.FailuresAccessor.GetFailureMessages
Provides access to the individual failure messages currently posted in the document.
Remarks:
Returned set of messages will be ordered from more severe to less severe.
Returns:
The accessors to the individual failure messages posted in the document.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailuresAccessor is inactive (is used outside of failures processing).
Since:
2011

Autodesk.Revit.DB.FailuresAccessor.SetTransactionName(System.String)
Changes the name of the transaction for which failures are being processed.
Remarks:
If the transaction will be committed by or after failures processing it can change its name to reflect
results of processing of the failures. For example, if the original transaction name was "review warnings" and
some of the warnings were resolved by deleting of the relevant elements, failures processor may
change the name of the transaction to "delete elements".
transactionName:
The name of the transaction to set.
Throws Autodesk.Revit.Exceptions.ArgumentException:
transactionName is an empty string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailuresAccessor is inactive (is used outside of failures processing).
Since:
2011

Autodesk.Revit.DB.FailuresAccessor.GetTransactionName
Retrieves the name of the transaction for which failures are being processed.
Returns:
The name of the transaction for which failures are being processed.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailuresAccessor is inactive (is used outside of failures processing).
Since:
2011

Autodesk.Revit.DB.FailuresAccessor.GetSeverity
Provides access to the current failure severity.
Returns:
The highest severity of a failure message currently posted in the document.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailuresAccessor is inactive (is used outside of failures processing).
Since:
2011

Autodesk.Revit.DB.FailuresAccessor.GetDocument
Provides access to a document for which failures are being processed or preprocessed.
Returns:
The document for which failures preprocessing or processing is being performed.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailuresAccessor is inactive (is used outside of failures processing).
Since:
2011

Autodesk.Revit.DB.FailuresAccessor.IsActive
Method allows to check if this instance of the accessor is currently active.
Remarks:
Generally, this instance is active when it is passed to any of interfaces used in the process of failure resolution,
and becomes inactive after returning control to Revit.
The only special case is if failures processor returns WaitForUserInput,
in which case document stays in the FailureMode and instance of failures accessor stays active till FailureMode is ended.
Returns:
True if this instance is currently active and can be used.
Since:
2011

Autodesk.Revit.DB.FailuresAccessor.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.FailuresAccessor
An interface class that provides access to failure information posted in a document and methods to resolve these failures.
Remarks:
An instance of this class can be obtained only as an argument passed to interfaces used in the process of failure resolution
and is the only available interface to fetch information about failures in a document.
While reading from a document during failure processing is allowed, the only way to modify document during failure resolution is via methods
provided by this class.
After returning from failure processing, the instance of the class is deactivated and cannot be used any longer.
Since:
2011